{
	"assignment": "storing a new value into an already existing variable; replacing the previous value.",
	"blit": "to copy a large section of image data from one surface to another. This is how you draw a sprite on the screen.  Blit can also be used to implement semi",
	"collection": "an object that stores a group of other objects; called its elements.",
	"colors": "Colours are defined as RGB (red; green; blue) and mixing them. Each base color is represented as a number between 0 (minimum) and 255 (maximum) which occupies 1 byte in memory",
	"comments": "text that programmers include in a program to explain their code.  The interpreter ignores comments.",
	"conditional": "a syntactic structure that controls other statements",
	"console input or user input": "responses typed in by the user when an interactive program pauses for input.",
	"cumulative algorithm": "An operation in which an overall value is computed incrementally; often using a loop.",
	"data type": "a name for a group of values that are all related; such as all integers or int in Python.",
	"decrementing": "decreasing a value; default is 1; but it can be specified.",
	"defensive programming": "is the process by which you create code that does not crash even when the user might enter something wrong or questionable.  Raising an exception is an example of Defensive Programming sometimes referred to as “bullet proofing your code.”",
	"dictionary": "a collection of key/value pairs in which each key is associated with a corresponding value. (or efficiently looked up using its key).",
	"dictionary comprehension": "an expression that specifies a new dictionary and its elements based on an existing dictionary or other sequence of values (in layman’s terms think copy).",
	"dirty rects": "a rectangle area of what has changed on the screen. Called dirty rects because the rectangle has been dirtied (ie: modified). Useful for speeding up screen redraws; because if only part of the screen has changed; then you only need to update that part of the screen again.",
	"display": "(graphical display) PyGame has it’s own display separate from the console.  The display submodule of PyGame helps to control how the overall game looks and acts.",
	"display(pygame)": "special display mode; helps control how the overall game looks and acts",
	"explicit conversion": "you must put the type name in front of the expression in Python. type(expression)",
	"expression": "a simple value or a set of operations that produces a value.",
	"factoring": "Moving common code our of an if/else statements to remove redundancy.",
	"flow of control": "The order in which the statements of a program are executed.",
	"implicit conversion": "two numbers that are frequently mixed are ints and floats.  Python converts the int to a float automatically when computing values.",
	"incrementing": "increasing a value; default is 1; but it can be specified.",
	"initialization": "defining a variable for the first time in your program.",
	"input modules": "tools for dealing with user input from a mouse; keyboard; or joystick. There is a built-in Pygame object to represent mouse; keyboard and tools.",
	"key": "a unique identifier for a record of data that a user wants to look up.",
	"keywords": "a set of words that have a specific meaning that cannot be randomly used as variables or names.  Examples are True False class if else.  For a full set please see Python Keywords",
	"list": "an ordered collection of values (elements); often accessed using integer indexes of by iteration. (for loops)",
	"nested collection (compound collection)": "a collection that contains other collections inside it; such as a list of sets or a dictionary of lists.",
	"operator": "a special symbol (like + or *) that is used to indicate an operation to be performed on one or more values.",
	"precedence": "the power of an operator; which determines how to group and evaluate parts of an expression.",
	"rect": "an object that represents a rectangle.  Since all surfaces in pygame are rectangular; each one has a rect associated with it. Rect is used to help determine the size; position and collision of objects.",
	"set": "a collection of elements that is guaranteed to contain no duplicates.",
	"sprite": "a visual object; capable of moving around the screen and being animated. Pygame includes a simple sprite class and several Group classes to organize sprites.",
	"statement": "an executable (means it will run) unit of code that represents a single complete command.",
	"string literal": "any collection of text characters in quotes. (they usually make sense to someone; but they don’t have to!)",
	"surface": "an object that represents graphical information. In Pygame; the screen is a surface too. Loaded image data (.png; .jpg; .bmp) is stored in the surface and surfaces can be written out to image files.",
	"value": "information in a data collection that is related to a given key.",
	"variable": "a memory location with a name that stores a value.",
	"variable definition": "a request to set aside memory for a new variable with a given name and value.",
	"variables": "a memory location with a name that stores a value",
	"whitespace": "blank characters such as spaces; tabs; line breaks etc. are called whitespace.",
}